Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/pio/pic32ck2051gc01144.h
#define PIN_PB22M_CCL_IN0                          _UINT32_(54)
#define MUX_PB22M_CCL_IN0                          _UINT32_(12)
#define PINMUX_PB22M_CCL_IN0                       ((PIN_PB22M_CCL_IN0 << 16) | MUX_PB22M_CCL_IN0)
#define PORT_PB22M_CCL_IN0                         (_UINT32_(1) << 22)

#define PIN_PB08M_CCL_IN1                          _UINT32_(40)
#define MUX_PB08M_CCL_IN1                          _UINT32_(12)
#define PINMUX_PB08M_CCL_IN1                       ((PIN_PB08M_CCL_IN1 << 16) | MUX_PB08M_CCL_IN1)
#define PORT_PB08M_CCL_IN1                         (_UINT32_(1) << 8)

#define PIN_PB23M_CCL_IN1                          _UINT32_(55)
#define MUX_PB23M_CCL_IN1                          _UINT32_(12)
#define PINMUX_PB23M_CCL_IN1                       ((PIN_PB23M_CCL_IN1 << 16) | MUX_PB23M_CCL_IN1)
#define PORT_PB23M_CCL_IN1                         (_UINT32_(1) << 23)

#define PIN_PB09M_CCL_IN2                          _UINT32_(41)
#define MUX_PB09M_CCL_IN2                          _UINT32_(12)
#define PINMUX_PB09M_CCL_IN2                       ((PIN_PB09M_CCL_IN2 << 16) | MUX_PB09M_CCL_IN2)
#define PORT_PB09M_CCL_IN2                         (_UINT32_(1) << 9)

#define PIN_PB24M_CCL_IN2                          _UINT32_(56)
#define MUX_PB24M_CCL_IN2                          _UINT32_(12)
#define PINMUX_PB24M_CCL_IN2                       ((PIN_PB24M_CCL_IN2 << 16) | MUX_PB24M_CCL_IN2)
#define PORT_PB24M_CCL_IN2                         (_UINT32_(1) << 24)

#define PIN_PC10M_CCL_IN3                          _UINT32_(74)
#define MUX_PC10M_CCL_IN3                          _UINT32_(12)
#define PINMUX_PC10M_CCL_IN3                       ((PIN_PC10M_CCL_IN3 << 16) | MUX_PC10M_CCL_IN3)
#define PORT_PC10M_CCL_IN3                         (_UINT32_(1) << 10)

#define PIN_PC24M_CCL_IN3                          _UINT32_(88)
#define MUX_PC24M_CCL_IN3                          _UINT32_(12)
#define PINMUX_PC24M_CCL_IN3                       ((PIN_PC24M_CCL_IN3 << 16) | MUX_PC24M_CCL_IN3)
#define PORT_PC24M_CCL_IN3                         (_UINT32_(1) << 24)

#define PIN_PC11M_CCL_IN4                          _UINT32_(75)
#define MUX_PC11M_CCL_IN4                          _UINT32_(12)
#define PINMUX_PC11M_CCL_IN4                       ((PIN_PC11M_CCL_IN4 << 16) | MUX_PC11M_CCL_IN4)
#define PORT_PC11M_CCL_IN4                         (_UINT32_(1) << 11)

#define PIN_PC25M_CCL_IN4                          _UINT32_(89)
#define MUX_PC25M_CCL_IN4                          _UINT32_(12)
#define PINMUX_PC25M_CCL_IN4                       ((PIN_PC25M_CCL_IN4 << 16) | MUX_PC25M_CCL_IN4)
#define PORT_PC25M_CCL_IN4                         (_UINT32_(1) << 25)

#define PIN_PC12M_CCL_IN5                          _UINT32_(76)
#define MUX_PC12M_CCL_IN5                          _UINT32_(12)
#define PINMUX_PC12M_CCL_IN5                       ((PIN_PC12M_CCL_IN5 << 16) | MUX_PC12M_CCL_IN5)
#define PORT_PC12M_CCL_IN5                         (_UINT32_(1) << 12)

#define PIN_PC26M_CCL_IN5                          _UINT32_(90)
#define MUX_PC26M_CCL_IN5                          _UINT32_(12)
#define PINMUX_PC26M_CCL_IN5                       ((PIN_PC26M_CCL_IN5 << 16) | MUX_PC26M_CCL_IN5)
#define PORT_PC26M_CCL_IN5                         (_UINT32_(1) << 26)

#define PIN_PD08M_CCL_IN6                          _UINT32_(104)
#define MUX_PD08M_CCL_IN6                          _UINT32_(12)
#define PINMUX_PD08M_CCL_IN6                       ((PIN_PD08M_CCL_IN6 << 16) | MUX_PD08M_CCL_IN6)
#define PORT_PD08M_CCL_IN6                         (_UINT32_(1) << 8)

#define PIN_PD17M_CCL_IN6                          _UINT32_(113)
#define MUX_PD17M_CCL_IN6                          _UINT32_(12)
#define PINMUX_PD17M_CCL_IN6                       ((PIN_PD17M_CCL_IN6 << 16) | MUX_PD17M_CCL_IN6)
#define PORT_PD17M_CCL_IN6                         (_UINT32_(1) << 17)

#define PIN_PD09M_CCL_IN7                          _UINT32_(105)
#define MUX_PD09M_CCL_IN7                          _UINT32_(12)
#define PINMUX_PD09M_CCL_IN7                       ((PIN_PD09M_CCL_IN7 << 16) | MUX_PD09M_CCL_IN7)
#define PORT_PD09M_CCL_IN7                         (_UINT32_(1) << 9)

#define PIN_PD18M_CCL_IN7                          _UINT32_(114)
#define MUX_PD18M_CCL_IN7                          _UINT32_(12)
#define PINMUX_PD18M_CCL_IN7                       ((PIN_PD18M_CCL_IN7 << 16) | MUX_PD18M_CCL_IN7)
#define PORT_PD18M_CCL_IN7                         (_UINT32_(1) << 18)

#define PIN_PD10M_CCL_IN8                          _UINT32_(106)
#define MUX_PD10M_CCL_IN8                          _UINT32_(12)
#define PINMUX_PD10M_CCL_IN8                       ((PIN_PD10M_CCL_IN8 << 16) | MUX_PD10M_CCL_IN8)
#define PORT_PD10M_CCL_IN8                         (_UINT32_(1) << 10)

#define PIN_PD19M_CCL_IN8                          _UINT32_(115)
#define MUX_PD19M_CCL_IN8                          _UINT32_(12)
#define PINMUX_PD19M_CCL_IN8                       ((PIN_PD19M_CCL_IN8 << 16) | MUX_PD19M_CCL_IN8)
#define PORT_PD19M_CCL_IN8                         (_UINT32_(1) << 19)

#define PIN_PA04M_CCL_IN9                          _UINT32_(4) 
#define MUX_PA04M_CCL_IN9                          _UINT32_(12)
#define PINMUX_PA04M_CCL_IN9                       ((PIN_PA04M_CCL_IN9 << 16) | MUX_PA04M_CCL_IN9)
#define PORT_PA04M_CCL_IN9                         (_UINT32_(1) << 4)

#define PIN_PA13M_CCL_IN9                          _UINT32_(13)
#define MUX_PA13M_CCL_IN9                          _UINT32_(12)
#define PINMUX_PA13M_CCL_IN9                       ((PIN_PA13M_CCL_IN9 << 16) | MUX_PA13M_CCL_IN9)
#define PORT_PA13M_CCL_IN9                         (_UINT32_(1) << 13)

#define PIN_PA05M_CCL_IN10                         _UINT32_(5) 
#define MUX_PA05M_CCL_IN10                         _UINT32_(12)
#define PINMUX_PA05M_CCL_IN10                      ((PIN_PA05M_CCL_IN10 << 16) | MUX_PA05M_CCL_IN10)
#define PORT_PA05M_CCL_IN10                        (_UINT32_(1) << 5)

#define PIN_PA14M_CCL_IN10                         _UINT32_(14)
#define MUX_PA14M_CCL_IN10                         _UINT32_(12)
#define PINMUX_PA14M_CCL_IN10                      ((PIN_PA14M_CCL_IN10 << 16) | MUX_PA14M_CCL_IN10)
#define PORT_PA14M_CCL_IN10                        (_UINT32_(1) << 14)

