Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/pio/pic32ck2051gc01144.h
#define PIN_PB07D_SERCOM4_PAD2                     _UINT32_(39)
#define MUX_PB07D_SERCOM4_PAD2                     _UINT32_(3) 
#define PINMUX_PB07D_SERCOM4_PAD2                  ((PIN_PB07D_SERCOM4_PAD2 << 16) | MUX_PB07D_SERCOM4_PAD2)
#define PORT_PB07D_SERCOM4_PAD2                    (_UINT32_(1) << 7)

#define PIN_PB13C_SERCOM4_PAD2                     _UINT32_(45)
#define MUX_PB13C_SERCOM4_PAD2                     _UINT32_(2) 
#define PINMUX_PB13C_SERCOM4_PAD2                  ((PIN_PB13C_SERCOM4_PAD2 << 16) | MUX_PB13C_SERCOM4_PAD2)
#define PORT_PB13C_SERCOM4_PAD2                    (_UINT32_(1) << 13)

#define PIN_PB19C_SERCOM4_PAD2                     _UINT32_(51)
#define MUX_PB19C_SERCOM4_PAD2                     _UINT32_(2) 
#define PINMUX_PB19C_SERCOM4_PAD2                  ((PIN_PB19C_SERCOM4_PAD2 << 16) | MUX_PB19C_SERCOM4_PAD2)
#define PORT_PB19C_SERCOM4_PAD2                    (_UINT32_(1) << 19)

#define PIN_PC00C_SERCOM4_PAD2                     _UINT32_(64)
#define MUX_PC00C_SERCOM4_PAD2                     _UINT32_(2) 
#define PINMUX_PC00C_SERCOM4_PAD2                  ((PIN_PC00C_SERCOM4_PAD2 << 16) | MUX_PC00C_SERCOM4_PAD2)
#define PORT_PC00C_SERCOM4_PAD2                    (_UINT32_(1) << 0)

#define PIN_PB08D_SERCOM4_PAD3                     _UINT32_(40)
#define MUX_PB08D_SERCOM4_PAD3                     _UINT32_(3) 
#define PINMUX_PB08D_SERCOM4_PAD3                  ((PIN_PB08D_SERCOM4_PAD3 << 16) | MUX_PB08D_SERCOM4_PAD3)
#define PORT_PB08D_SERCOM4_PAD3                    (_UINT32_(1) << 8)

#define PIN_PB06C_SERCOM4_PAD3                     _UINT32_(38)
#define MUX_PB06C_SERCOM4_PAD3                     _UINT32_(2) 
#define PINMUX_PB06C_SERCOM4_PAD3                  ((PIN_PB06C_SERCOM4_PAD3 << 16) | MUX_PB06C_SERCOM4_PAD3)
#define PORT_PB06C_SERCOM4_PAD3                    (_UINT32_(1) << 6)

#define PIN_PB20C_SERCOM4_PAD3                     _UINT32_(52)
#define MUX_PB20C_SERCOM4_PAD3                     _UINT32_(2) 
#define PINMUX_PB20C_SERCOM4_PAD3                  ((PIN_PB20C_SERCOM4_PAD3 << 16) | MUX_PB20C_SERCOM4_PAD3)
#define PORT_PB20C_SERCOM4_PAD3                    (_UINT32_(1) << 20)

#define PIN_PC01C_SERCOM4_PAD3                     _UINT32_(65)
#define MUX_PC01C_SERCOM4_PAD3                     _UINT32_(2) 
#define PINMUX_PC01C_SERCOM4_PAD3                  ((PIN_PC01C_SERCOM4_PAD3 << 16) | MUX_PC01C_SERCOM4_PAD3)
#define PORT_PC01C_SERCOM4_PAD3                    (_UINT32_(1) << 1)

/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_PA05D_SERCOM5_PAD0                     _UINT32_(5) 
#define MUX_PA05D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PA05D_SERCOM5_PAD0                  ((PIN_PA05D_SERCOM5_PAD0 << 16) | MUX_PA05D_SERCOM5_PAD0)
#define PORT_PA05D_SERCOM5_PAD0                    (_UINT32_(1) << 5)

#define PIN_PA11C_SERCOM5_PAD0                     _UINT32_(11)
#define MUX_PA11C_SERCOM5_PAD0                     _UINT32_(2) 
#define PINMUX_PA11C_SERCOM5_PAD0                  ((PIN_PA11C_SERCOM5_PAD0 << 16) | MUX_PA11C_SERCOM5_PAD0)
#define PORT_PA11C_SERCOM5_PAD0                    (_UINT32_(1) << 11)

#define PIN_PA13C_SERCOM5_PAD0                     _UINT32_(13)
#define MUX_PA13C_SERCOM5_PAD0                     _UINT32_(2) 
#define PINMUX_PA13C_SERCOM5_PAD0                  ((PIN_PA13C_SERCOM5_PAD0 << 16) | MUX_PA13C_SERCOM5_PAD0)
#define PORT_PA13C_SERCOM5_PAD0                    (_UINT32_(1) << 13)

#define PIN_PA24C_SERCOM5_PAD0                     _UINT32_(24)
#define MUX_PA24C_SERCOM5_PAD0                     _UINT32_(2) 
#define PINMUX_PA24C_SERCOM5_PAD0                  ((PIN_PA24C_SERCOM5_PAD0 << 16) | MUX_PA24C_SERCOM5_PAD0)
#define PORT_PA24C_SERCOM5_PAD0                    (_UINT32_(1) << 24)

#define PIN_PA06D_SERCOM5_PAD1                     _UINT32_(6) 
#define MUX_PA06D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PA06D_SERCOM5_PAD1                  ((PIN_PA06D_SERCOM5_PAD1 << 16) | MUX_PA06D_SERCOM5_PAD1)
#define PORT_PA06D_SERCOM5_PAD1                    (_UINT32_(1) << 6)

#define PIN_PA12C_SERCOM5_PAD1                     _UINT32_(12)
#define MUX_PA12C_SERCOM5_PAD1                     _UINT32_(2) 
#define PINMUX_PA12C_SERCOM5_PAD1                  ((PIN_PA12C_SERCOM5_PAD1 << 16) | MUX_PA12C_SERCOM5_PAD1)
#define PORT_PA12C_SERCOM5_PAD1                    (_UINT32_(1) << 12)

#define PIN_PA14C_SERCOM5_PAD1                     _UINT32_(14)
#define MUX_PA14C_SERCOM5_PAD1                     _UINT32_(2) 
#define PINMUX_PA14C_SERCOM5_PAD1                  ((PIN_PA14C_SERCOM5_PAD1 << 16) | MUX_PA14C_SERCOM5_PAD1)
#define PORT_PA14C_SERCOM5_PAD1                    (_UINT32_(1) << 14)

#define PIN_PA25C_SERCOM5_PAD1                     _UINT32_(25)
#define MUX_PA25C_SERCOM5_PAD1                     _UINT32_(2) 
#define PINMUX_PA25C_SERCOM5_PAD1                  ((PIN_PA25C_SERCOM5_PAD1 << 16) | MUX_PA25C_SERCOM5_PAD1)
#define PORT_PA25C_SERCOM5_PAD1                    (_UINT32_(1) << 25)

#define PIN_PA07D_SERCOM5_PAD2                     _UINT32_(7) 
#define MUX_PA07D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PA07D_SERCOM5_PAD2                  ((PIN_PA07D_SERCOM5_PAD2 << 16) | MUX_PA07D_SERCOM5_PAD2)
#define PORT_PA07D_SERCOM5_PAD2                    (_UINT32_(1) << 7)

#define PIN_PA15C_SERCOM5_PAD2                     _UINT32_(15)
#define MUX_PA15C_SERCOM5_PAD2                     _UINT32_(2) 
#define PINMUX_PA15C_SERCOM5_PAD2                  ((PIN_PA15C_SERCOM5_PAD2 << 16) | MUX_PA15C_SERCOM5_PAD2)
#define PORT_PA15C_SERCOM5_PAD2                    (_UINT32_(1) << 15)

#define PIN_PA26C_SERCOM5_PAD2                     _UINT32_(26)
#define MUX_PA26C_SERCOM5_PAD2                     _UINT32_(2) 
#define PINMUX_PA26C_SERCOM5_PAD2                  ((PIN_PA26C_SERCOM5_PAD2 << 16) | MUX_PA26C_SERCOM5_PAD2)
#define PORT_PA26C_SERCOM5_PAD2                    (_UINT32_(1) << 26)

#define PIN_PB00C_SERCOM5_PAD2                     _UINT32_(32)
#define MUX_PB00C_SERCOM5_PAD2                     _UINT32_(2) 
#define PINMUX_PB00C_SERCOM5_PAD2                  ((PIN_PB00C_SERCOM5_PAD2 << 16) | MUX_PB00C_SERCOM5_PAD2)
#define PORT_PB00C_SERCOM5_PAD2                    (_UINT32_(1) << 0)

#define PIN_PA08D_SERCOM5_PAD3                     _UINT32_(8) 
#define MUX_PA08D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PA08D_SERCOM5_PAD3                  ((PIN_PA08D_SERCOM5_PAD3 << 16) | MUX_PA08D_SERCOM5_PAD3)
#define PORT_PA08D_SERCOM5_PAD3                    (_UINT32_(1) << 8)

#define PIN_PA16C_SERCOM5_PAD3                     _UINT32_(16)
#define MUX_PA16C_SERCOM5_PAD3                     _UINT32_(2) 
#define PINMUX_PA16C_SERCOM5_PAD3                  ((PIN_PA16C_SERCOM5_PAD3 << 16) | MUX_PA16C_SERCOM5_PAD3)
#define PORT_PA16C_SERCOM5_PAD3                    (_UINT32_(1) << 16)

#define PIN_PA27C_SERCOM5_PAD3                     _UINT32_(27)
#define MUX_PA27C_SERCOM5_PAD3                     _UINT32_(2) 
#define PINMUX_PA27C_SERCOM5_PAD3                  ((PIN_PA27C_SERCOM5_PAD3 << 16) | MUX_PA27C_SERCOM5_PAD3)
#define PORT_PA27C_SERCOM5_PAD3                    (_UINT32_(1) << 27)

#define PIN_PB01C_SERCOM5_PAD3                     _UINT32_(33)
#define MUX_PB01C_SERCOM5_PAD3                     _UINT32_(2) 
#define PINMUX_PB01C_SERCOM5_PAD3                  ((PIN_PB01C_SERCOM5_PAD3 << 16) | MUX_PB01C_SERCOM5_PAD3)
#define PORT_PB01C_SERCOM5_PAD3                    (_UINT32_(1) << 1)

